<?php
/**************************************************************************
 * 类名称：MatchConfig
 * 类功能：彩虹包比赛配置信息
 * 编写人员：jack
 * 编写时间：2017-08-09
 **************************************************************************/
class MatchConfig{
	//彩虹包金额类型设定
	public static $arr_type = array(
		0=>'100',
		1=>'200',
		2=>'500',
		3=>'1000'
	);
	//彩虹包发放红包数量设定
	public static $arr_num = array(
		0=>'10',
		1=>'20',
		2=>'50',
		3=>'100'
	);	
	//彩虹包金额类型设定及不同金额类型彩虹包规则配置(key为彩虹包金额)
	public static $arr_rule = array(
		'100'=>array(
			'real_amount'=>'90',//实际用来抽奖金额总数
			'one_prize'=>'58',//一等奖金额数
			'two_prize'=>'18',//二等奖金额数
			'other_prize'=>'14',//其它奖金额数
			'commissions'=>'0.03',//支付佣金百分比
		),
		'200'=>array(
			'real_amount'=>'180',//实际用来抽奖金额总数
			'one_prize'=>'128',//一等奖金额数
			'two_prize'=>'28',//二等奖金额数
			'other_prize'=>'24',//其它奖金额数
			'commissions'=>'0.03',//支付佣金百分比
		),
		'500'=>array(
			'real_amount'=>'450',//实际用来抽奖金额总数
			'one_prize'=>'288',//一等奖金额数
			'two_prize'=>'88',//二等奖金额数
			'other_prize'=>'74',//其它奖金额数
			'commissions'=>'0.02',//支付佣金百分比
		),
		'1000'=>array(
			'real_amount'=>'900',//实际用来抽奖金额总数
			'one_prize'=>'588',//一等奖金额数
			'two_prize'=>'188',//二等奖金额数
			'other_prize'=>'124',//其它奖金额数
			'commissions'=>'0.02',//支付佣金百分比
		),		
	);
}
?>